#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Time:        2023/9/13 16:02
# @Author:      @远行人
# @targer_url:
# @Software:    PyCharm

# =============================================================================
# 【检测点】
# : 接口返回结果加密

# 【Devtools 抓包】
# :正常抓包，请求时只有一个接口

# 【思路】
# :xhs断点向下调试，找到数据解密入口
# fireWith: function(e, t) {
#                 return a || (t = [e, (t = t || []).slice ? t.slice() : t],
#                 u.push(t),
#                 i || c()),
#                 this
#             }
# 注意函数c从闭包环境变量中取值，尤其注意arguments中是否有我们要跟的值
# 拿到解密函数在控制台对密文进行解密调试确定入口
# 然后抠代码补环境，将解密函数抠出来
# =============================================================================

